package HomeWork33;

public class HomeWork33 {
    public static void main(String[] args) {
        //1) Напишите лямбда-выражение, которое принимает два целых числа и возвращает их сумму.
        System.out.println("Задание 1. Вывод:");

        System.out.println();

        //2) Создайте лямбда-выражение, которое проверяет, является ли строка пустой.
        System.out.println("Задание 2. Вывод:");

        System.out.println();

        //3) Напишите лямбда-выражение, которое принимает строку и возвращает её длину.
        System.out.println("Задание 3. Вывод:");

        System.out.println();

        //4) Создайте лямбда-выражение, которое возвращает максимальное из двух чисел.
        System.out.println("Задание 4. Вывод:");

        System.out.println();

        //5) Напишите лямбда-выражение для проверки, является ли число четным.
        System.out.println("Задание 5. Вывод:");

        System.out.println();

        //6) Напишите лямбда-выражение, которое возводит число в квадрат.
        System.out.println("Задание 6. Вывод:");

        System.out.println();

        //7) Создайте лямбда-выражение, которое выводит на экран строку.
        System.out.println("Задание 7. Вывод:");

        System.out.println();

        //8) Напишите лямбда-выражение, которое принимает строку и возвращает её в верхнем регистре.
        System.out.println("Задание 8. Вывод:");

        System.out.println();

        //9) Напишите лямбда-выражение, которое проверяет, содержит ли строка подстроку.
        System.out.println("Задание 9. Вывод:");

        System.out.println();

        //10) Напишите лямбда-выражение, которое преобразует строку в число.
        System.out.println("Задание 10. Вывод:");

        System.out.println();

        //11) Создайте лямбда-выражение, которое умножает два числа и возвращает результат.
        System.out.println("Задание 11. Вывод:");

        System.out.println();

        //12) Напишите лямбда-выражение, которое проверяет, является ли число положительным.
        System.out.println("Задание 12. Вывод:");

        System.out.println();

        //13) Напишите лямбда-выражение для фильтрации всех чётных чисел из списка.
        System.out.println("Задание 13. Вывод:");

        System.out.println();

        //14) Напишите лямбда-выражение, которое находит наибольший элемент в списке чисел.
        System.out.println("Задание 14. Вывод:");

        System.out.println();

        //15) Напишите лямбда-выражение, которое сортирует список строк по длине.
        System.out.println("Задание 15. Вывод:");

        System.out.println();

        //16) Создайте лямбда-выражение, которое возвращает строку без пробелов в начале и в конце.
        System.out.println("Задание 16. Вывод:");

        System.out.println();

        //17) Напишите лямбда-выражение, которое объединяет два списка в один.
        System.out.println("Задание 17. Вывод:");

        System.out.println();

        //18) Напишите лямбда-выражение, которое возвращает строку с первой буквой в верхнем регистре.
        System.out.println("Задание 18. Вывод:");

        System.out.println();

        //19) Напишите лямбда-выражение, которое находит разницу между двумя датами.
        System.out.println("Задание 19. Вывод:");

        System.out.println();

        //20) Напишите лямбда-выражение, которое проверяет, является ли строка числом.
        System.out.println("Задание 20. Вывод:");

        System.out.println();
    }
}
