public class HomeWork17 {
    public static void main(String[] args) {
        //Задание 1
        //Создайте класс Circle, который имеет:
        //Поле radius (тип double).
        //Конструктор для установки радиуса.
        //Метод calculateArea(), который возвращает площадь круга.


        //Задание 2
        //Создайте класс Rectangle, который имеет:
        //Поля length и width (оба типа double).
        //Конструктор для установки длины и ширины.
        //Метод calculatePerimeter(), который возвращает периметр прямоугольника.


        //Задание 3
        //Создайте класс Student, который имеет:
        //Поля name (тип String) и age (тип int).
        //Конструктор для установки имени и возраста.
        //Метод displayInfo(), который выводит имя и возраст студента в консоль.


        //Задание 4
        //Создайте класс Car, который имеет:
        //Поля brand (тип String) и speed (тип int).
        //Конструктор для установки бренда и начальной скорости.
        //Метод accelerate(int increment), который увеличивает скорость на указанное значение.


        //Задание 5
        //Создайте класс Book, который имеет:
        //Поля title (тип String) и author (тип String).
        //Конструктор для установки названия книги и автора.
        //Метод getBookInfo(), который возвращает строку с информацией о книге.


        //Задание 6
        //Создайте класс Point, который имеет:
        //Поля x и y (оба типа int).
        //Конструктор для установки координат точки.
        //Метод move(int dx, int dy), который изменяет координаты точки на заданное смещение.


        //Задание 7
        //Создайте класс Person, который имеет:
        //Поля firstName и lastName (оба типа String).
        //Конструктор для установки имени и фамилии.
        //Метод getFullName(), который возвращает полное имя человека.


        //Задание 8
        //Создайте класс Temperature, который имеет:
        //Поле celsius (тип double).
        //Конструктор для установки температуры в градусах Цельсия.
        //Методы toFahrenheit() и toKelvin(), которые возвращают температуру в Фаренгейтах и Кельвинах соответственно.


        //Задание 9
        //Создайте класс Counter, который имеет:
        //Поле count (тип int), изначально равное 0.
        //Метод increment(), который увеличивает значение поля на 1.
        //Метод decrement(), который уменьшает значение поля на 1.
        //Метод getCount(), который возвращает текущее значение счетчика.


        //Задание 10
        //Создайте класс Time, который имеет:
        //Поля hours и minutes (оба типа int).
        //Конструктор для установки времени.
        //Метод addMinutes(int minutes), который добавляет заданное количество минут к времени и корректно обновляет часы.
    }
}
