public class HomeWork11 {
    //Метод для задания 1
    private static int factorial(int num) {
        int result=1;
        if (num > 0) {
            result = result* num;
            num--;
        }
        factorial(num);
        return result;
    }

    //Метод для задания 2
    //Метод для задания 3
    //Метод для задания 4
    //Метод для задания 5
    //Метод для задания 6
    //Метод для задания 7
    //Метод для задания 8
    //Метод для задания 9
    //Метод для задания 10
    //Метод для задания 11
    //Метод для задания 12
    //Метод для задания 13
    //Метод для задания 14
    //Метод для задания 15
    //Метод для задания 16
    //Метод для задания 17
    //Метод для задания 18
    //Метод для задания 19
    //Метод для задания 10
    public static void main(String[] args) {
        //Написать метод, который возвращает факториал заданного числа.
        System.out.println("Задание 1. Вывод:");
        System.out.println(factorial(5));
        System.out.println();
        //Написать метод, который возвращает среднее арифметическое массива чисел.
        System.out.println("Задание 2. Вывод:");
        System.out.println();
        //Написать метод, который возвращает сумму элементов массива.
        System.out.println("Задание 3. Вывод:");
        System.out.println();
        //Написать метод, который возвращает произведение элементов массива.
        System.out.println("Задание 4. Вывод:");
        System.out.println();
        //Написать метод, который возвращает наибольшее число из массива.
        System.out.println("Задание 5. Вывод:");
        System.out.println();
        //Написать метод, который возвращает наименьшее число из массива.
        System.out.println("Задание 6. Вывод:");
        System.out.println();
        //Написать метод, который возвращает разницу между максимальным и минимальным элементом массива.
        System.out.println("Задание 7. Вывод:");
        System.out.println();
        //Написать метод, который возвращает сумму квадратов элементов массива.
        System.out.println("Задание 8. Вывод:");
        System.out.println();
        //Написать метод, который находит объем цилиндра по радиусу и высоте.
        System.out.println("Задание 9. Вывод:");
        System.out.println();
        //Написать метод, который вычисляет гипотенузу прямоугольного треугольника по двум катетам.
        System.out.println("Задание 10. Вывод:");
        System.out.println();
        //Написать метод, который возвращает сумму чисел от 1 до заданного числа без использования циклов и условий.
        System.out.println("Задание 11. Вывод:");
        System.out.println();
        //Написать метод, который проверяет, является ли число степенью двойки.
        System.out.println("Задание 12. Вывод:");
        System.out.println();
        //Написать метод, который вычисляет сумму чисел, кратных 3 или 5, в заданном диапазоне.
        System.out.println("Задание 13. Вывод:");
        System.out.println();
        //Написать метод, который возвращает сумму цифр числа.
        System.out.println("Задание 14. Вывод:");
        System.out.println();
        //Написать метод, который возвращает произведение цифр числа.
        System.out.println("Задание 15. Вывод:");
        System.out.println();
        //Написать метод, который возвращает количество цифр в числе.
        System.out.println("Задание 16. Вывод:");
        System.out.println();
        //Написать метод, который возвращает число, полученное в результате зеркального отображения (реверса) заданного числа.
        System.out.println("Задание 17. Вывод:");
        System.out.println();
        //Написать метод, который возвращает значение числа Фибоначчи с заданным номером.
        System.out.println("Задание 18. Вывод:");
        System.out.println();
        //Написать метод, который возвращает длину окружности по заданному радиусу.
        System.out.println("Задание 19. Вывод:");
        System.out.println();
        //Написать метод, который проверяет, является ли треугольник прямоугольным по трём сторонам.
        System.out.println("Задание 20. Вывод:");
        System.out.println();
    }
}
