package HomeWork38;

public class HomeWork38 {
    public static void main(String[] args) {
        //Читаем файл и анализируем символы через ASCII.
        //Нужно посчитать:
        //🔤 Количество слов
        //🔢 Количество чисел
        //📝 Количество предложений
        //🅰️ Количество гласных
        //🅱️ Количество согласных
        //➕ Количество знаков препинания (точка, запятая, !, ?, ;, : )
        //⏱ Время выполнения
        //Использовать потоки

        //Добавить какой-нибудь текст (текстовый файл большого размера)
        //запустить несколько потоков, которые будут просчитывать каждую конкретную задачу
        //добавить расчет времени выполнения задачи (надо уточнить, нужно ли выполнять однопоточные задачи для сравнения)
    }
}
