--✅ 1. Вывести названия всех книг и имена их авторов, отсортированных по имени автора (по возрастанию).
--Используй: SELECT, JOIN, ORDER BY

--✅ 2. Вывести всех студентов, у которых ещё нет читательских билетов (S_Cards).
--Используй: LEFT JOIN, WHERE, IS NULL

--✅ 3. Посчитать, сколько книг издаёт каждое издательство (Press) и отсортировать по убыванию.
--Используй: JOIN, GROUP BY, COUNT, ORDER BY

--✅ 4. Вывести имена и фамилии всех преподавателей, которых нет среди студентов.
--Используй: EXCEPT

--✅ 5. Показать список всех факультетов, даже если на них нет ни одного студента.
--Используй: LEFT JOIN

--✅ 6. Вывести список всех книг, темы которых начинаются на A или B.
--Используй: JOIN, LIKE

--✅ 7. Найти всех студентов с фамилией длиннее 8 символов.
--Используй: WHERE, ?

--✅ 8. Показать количество студентов в каждой группе.
--Используй: GROUP BY, COUNT

--✅ 9. Вывести топ 5 авторов по количеству книг, которые они написали.
--Используй: JOIN, GROUP BY, COUNT, ORDER BY, TOP

--✅ 10. Обновить фамилию всех студентов с именем "Ali" на "Aliev".
--Используй: UPDATE, WHERE